export default {
  title: "關於",
  "introduce.title": "我是黃勝弘，",
  "introduce.title.2": "是一名前端工程師。",
  "introduce.caption": `我是一名有將近3年前端實戰開發經驗的前端工程師，對網頁設計和開發有著強烈的熱情。
  我精通 HTML、CSS、JavaScript、TypeScript、Vue、Vuex、Nuxt.js、Node.js、express、React。
  除了必備的git版本控制外，我也理解並且會運用Docker、Golang、mongoDB 、MYSQL等技術。
  我喜歡研究功能背後的原理，曾經手刻過 Swiper、樹狀結構等插件，也喜歡研究程式架構及優化。
  我善於獨立解決問題，並能夠與其他開發者、設計師及PM進行有效的溝通和合作。同時也願意配合公司進度，進行加班。`,
  "introduce.label.birthday": "生日:",
  "introduce.label.age": "年齡:",
  "introduce.label.web": "Github:",
  "introduce.label.mail": "信箱:",
  "introduce.label.phone": "聯絡號碼:",
  "introduce.label.city": "城市:",
  "introduce.label.city.answer": "台灣 台中市",
  "experience.experience": "經歷",
  "experience.education": "學歷",
  "experience.experience.title.1": "巨兆數位有限公司",
  "experience.experience.caption.1": `一直以來，我在公司中擔任了許多專案的前端負責人。對於我參與的專案都深入了解，每一個細節都十分關注，從與PM及設計討論使用者介面的設計到程式碼的最佳化，我都參與其中。\n
此外，我有幸能和公司裡的資深前端工程師並肩工作，一起研究和改善專案的架構。這個經驗讓我學到了很多新的技術和最佳實踐，也使我了解到團隊合作是如何促進專案的成功以及能夠從中促進自身進步。`,
  "experience.experience.title.2": "群益數位有限公司",
  "experience.experience.caption.2": `進入這間公司，是我首次涉足軟體開發行業的起點。在這裡，我初次體驗到了實際的就業模式，並對工作的要求和期待有了更深入的理解。\n
在公司中，我獲得了學習和實驗各種開發框架的機會。我嘗試使用不同的工具，並學習了如何選擇最適合特定專案的框架。這些經驗提高了我的技術實力，也讓我對軟體開發有了更全面的了解。透過在這間公司的工作經歷，我不只增進了技術能力，更了解了軟體開發的實際運作模式，並體認到持續學習和嘗試的重要性。`,
  "experience.experience.title.3": "其他行業",
  "experience.experience.caption.3": `在我踏入軟體行業之前，我曾經踏足過多種行業，探索過各式各樣的職場。我在連鎖餐飲業擔任過副店長，負責管理人員和庫存；也曾在旅館業擔任儲備幹部和前台服務員，還曾是工地學徒以及鐵板燒廚師。每一個經歷都讓我學到寶貴的知識與技能。\n
在這些豐富的實戰經驗中，我不僅精進了專業技能，更學會了如何處理危機、如何與同事和諧相處，以及如何有效應對客戶。這些經歷為我在軟體行業中開創新的道路提供了堅實的基礎。`,
  "experience.experience.title.4": "享亦數位有限公司",
  "experience.experience.caption.4": `在公司擔任前端工程師期間，我承擔了一個特別的挑戰：使用Vue框架來開發遊戲及其相關架構。通常，Vue這類的框架很少被用於遊戲開發，這使得這項工作對我來說不僅是一次技術上的冒險，也是一個學習和成長的機會。在這個項目中，我不僅涉獵了前端的界面設計，還深入了解了後端數據的交互和維護。這一經驗對於提升我的前端技術和理解現代網絡應用的架構具有重要意義。\n此外，我還使用React和Vite來構建遊戲的後台管理系統。這一系統支持遊戲數據的管理和分析，提高了遊戲運營的效率和靈活性。在這個項目中，我不僅鍛煉了自己的前端開發技能，也加深了對現代Web開發技術和工具的理解。`,
  "experience.experience.title.5": "杰思數位有限公司",
  "experience.experience.caption.5": `我是一名前端工程師，但在目前任職的公司中，我已開始轉向全端工程師的角色。這段轉變的旅程讓我有機會深入後端開發，開始親自設計和撰寫 API，這些 API 不僅增強了我對整個應用架構的理解，也實際被運用於公司的專案中，有效提升了專案的效率和靈活性。\n
除此之外，我也有機會與第三方服務進行API串接，如Google Sheets，這讓我能夠處理更複雜的數據交互並優化我們的數據流。這些經驗不僅豐富了我的技術棧，也使我在解決實際問題和滿足用戶需求方面更為自信。\n
這些轉變使我能夠更全面地理解和參與項目的各個階段，從前端的用戶界面設計到後端的數據管理，我都能夠提供專業的技術支持和解決方案，使得我在技術領域中更為全面和適應性強`,
  "experience.education.title.1": "高中同等學歷",
  "experience.education.caption.1": `在我年輕的時候，因為懵懂，我未能充分把握學業的重要性。然而，隨著年紀的增長和視野的擴大，我意識到了學習的價值，並決定彌補我過去忽視的學業。\n
為了達到這個目標，我下定決心進修，並補足了我所缺失的學歷。在這個過程中，我不只學習到了學科知識，更深深體驗到了學習的喜悅，並對於我未來的職業生涯有了更清晰的規劃。我現在更加明白，學習和持續進步的過程，對於個人和職業的成長都是無價之寶。\n
因此，雖然我在早年間曾經荒廢了學業，但我從錯誤中吸取教訓，並且為自己的未來打下了更堅實的基礎。`,
  "experience.education.title.2": "台中高工",
  "experience.education.caption.2": `我在年輕的時候有幸考上了心儀的學校。然而，由於當時的我尚未完全理解學業的重要性，我選擇在高中二年級時休學，踏入了職場。
那時的我，滿懷著對未知世界的好奇與期待，迫不及待想要探索生活的多元面向。我認為，透過實際的工作經驗，我可以更加了解自己，並發掘出自我真正的興趣與方向。\n
雖然我提早踏入了社會，但我並未忘記學習的重要性。我始終保持著對知識的渴求，並持續自我提升，使我在職場上能夠更好地適應與成長。
回首過去，我並不後悔當初的選擇，因為那段經歷形塑了我今天的自我。我相信，無論在學校還是在職場，只要我保持著對知識的熱愛與好奇，我都能在生活中找到屬於自己的學習與成長之路。`,
  "experience.education.title.3": "埔里國中",
  "experience.education.caption.3": `我在中學時期就與電腦結下了不解之緣。因為時常遊玩電腦遊戲，我對電腦操作有著獨特的興趣，使我在這方面有著一定的基礎與操作。\n
學校的教育也給了我大量的機會去深化我的電腦技能。透過學校的資源，我參與了相關的比賽，並在此過程中更進一步強化了我對電腦的理解和操作能力。此外，我還努力地取得了相關的證照，進一步證明我在這一領域的專業能力。
因此，這段時期的經歷也算是我踏入軟體業的墊腳石`,
};
