export default {
  title: "作品集",
  introduction: "我的專案及作品集:",
  "list.view": "點我查看",
  "detail.title": "作品描述",
  rive: "Rive 動畫展示區",
  "list.title.1": "遊戲平台-AWD",
  "list.content.1-1": `此專案是一個遊戲集成平台，使用了AWD技術，專為PC版和手機版設計了各自的repository。
不論是在PC還是手機上，網站都會根據用戶的螢幕大小自動調整佈局，並跳轉到適應該設備的頁面，讓用戶無論在哪種設備上都能得到最佳的體驗。
同時此專案為了提供更快更流暢的瀏覽體驗，網站也實現了地理區域路由。前端於載入時會根據用戶IP地址的地理位置，自動將用戶導向最近的網絡節點，從而提高網頁加載速度，減少網絡延遲。`,
  "list.content.1-2": `此外，作為一個遊戲集成平台，此專案會串接遊戲供應商的API。讓用戶可以直接從我們的平台跳轉到遊戲商的遊戲頁面，達到一站式的遊戲體驗。
最後，此網站也添加了即時聊天功能。通過WebSocket，讓用戶可以在平台上進行即時的線上交流，類似line的聊天室。`,
  "list.content.1-3": `很抱歉的是因為此專案已經關閉了服務器，故只能以敘述及圖片來展示。`,
  "list.title.2": "官方網站-RWD",
  "list.title.3": "遊戲平台-Mobile",
  "list.content.2-1":
    "此專案是基於一個自製的Vue架構開發的，該架構有些類似於Nuxt，但在靈活性和可定制性上進行了大幅度的提升，使得開發者可以根據具體需求自定義功能。",
  "list.content.2-2": `在視覺效果方面，我們引入了Rive來製作可互動的動畫，使得頁面更生動、有趣，大大提升了用戶的體驗。用戶可以透過與動畫的互動來獲得樂趣，並進一步參與到我們的產品中。
我們的專案使用i18n進行了多國語系的支援，能夠自動根據瀏覽器語言設定選擇合適的語系，同時也為使用者提供了自由選擇語系的可能，保證了我們產品的國際化和多元化。
此外，我們還提供了豐富的互動內容，例如可拖曳的活動圖標，用於提醒用戶有新的未讀消息的紅點提示等。這些互動元素不僅提升了用戶的參與感，也使得信息的傳遞更加直觀和高效。`,
  "list.content.2-3": `此專案有測試環境可供操作，若您有想體驗操作的需求可以與我聯絡，這邊會提供測試帳號供您使用體驗。
若您只是想查看自製的rive動畫效果可以>>點我前往<<。在此網站中有提供用來展示的動畫效果。`,
  "list.content.keyword.2": "點我前往",
  "list.title.4": "仿刻寵物官網-RWD",
  "list.title.5": "餐飲店官網-RWD",
  "list.title.6": "部落格-RWD",
};
